# üêç SQL in Python üêç

This file intends to execute sql queries in python reading them from a sql script.

### 1Ô∏è‚É£ Importing the required libraries

In [1]:
import pandas as pd
import mysql.connector
import re

### 2Ô∏è‚É£ Setting connection and cursor

In [2]:
cnx = mysql.connector.connect(user='root', password='AlumnaAdalab', host='127.0.0.1', database='sakila')

In [3]:
mycursor = cnx.cursor()

### 3Ô∏è‚É£ Opening the sql script

In [4]:
with open("exercise_script.sql", "r") as file:
    sql_script = file.read()

The script file has comments, so we need to clean the queries.

In [93]:
clean_queries = [] # This list will have the cleaned queries.
     
for query in sql_script.split(";"):  # The queries are converted into a list, and are called in this loop.
    
    # Then the different types of comments in sql script file are deleted. 
    
    if '--' not in query: # This adds the USE sakila query.
        clean_queries.append(query.strip())
    elif '#' in query:
        query = re.sub(r'\s#+\s[A-Z]\s[A-Z]\s[A-Z]\s[A-Z]\s[A-Z]\s#+\s#+', '', query)
        query = re.sub(r'#', '', query)
        clean_queries.append(query.strip())
    elif query.startswith('/*'):
        query = re.sub(r'\/\*\s.*\s.+[a-zA-Z]+.+\s+[a-zA-Z].+\s+[a-zA-Z].+\s+[a-zA-Z].+\s+[a-zA-Z].+\s+[a-zA-Z].+', '', query)
        clean_queries.append(query.strip())
    if '--' in query:
        query = re.sub(r'--.*', '', query.strip())
        clean_queries.append(query.strip())

In [94]:
clean_queries

['USE sakila',
 'SELECT DISTINCT lower(title) AS film_title\n\tFROM film',
 'SELECT lower(title) AS film_title\n\tFROM film \n    WHERE rating = "PG-13"',
 'SELECT lower(title) AS film_title, lower(description)\n\tFROM film \n    WHERE description LIKE ("%amazing%")',
 'SELECT lower(title) AS film_title\n\tFROM film \n    WHERE length > 120',
 'SELECT lower(first_name) AS actor_name\n\tFROM actor',
 'SELECT CONCAT(lower(first_name), " ", lower(last_name)) AS actor_name\n\tFROM actor\n    WHERE last_name LIKE ("Gibson")',
 'SELECT lower(first_name) AS actor_name\n\tFROM actor\n    WHERE actor_id BETWEEN 10 AND 20',
 'SELECT lower(title) AS film_title\n\tFROM film \n    WHERE rating NOT IN ("R", "PG-13")',
 'SELECT rating, COUNT(rating) AS num_of_films\n\tFROM film\n    GROUP BY rating',
 'SELECT CONCAT(lower(c.first_name), " ", lower(c.last_name)) AS customer_name, COUNT(c.customer_id) AS rented_films\n\tFROM customer AS c\n    INNER JOIN rental AS r\n    USING (customer_id)\n    GROUP BY c.customer_id',
 'SELECT c.name AS category, COUNT(fc.category_id) AS rented_films\n\tFROM rental AS r\n    INNER JOIN inventory AS i\n    USING (inventory_id)\n    INNER JOIN film_category AS fc\n    USING (film_id)\n    INNER JOIN category as c\n    USING(category_id)\n    GROUP BY fc.category_id',
 'SELECT rating, ROUND(AVG(length),2) AS length_in_min\n\tFROM film\n    GROUP BY rating',
 'SELECT CONCAT(lower(first_name), " ", lower(last_name)) AS actor_name\n\tFROM actor AS a\n    INNER JOIN film_actor AS fa\n    USING (actor_id)\n    INNER JOIN film AS f\n    USING(film_id)\n    WHERE f.title = "Indian Love"',
 'SELECT lower(title) AS film_title\n\tFROM film\n    WHERE description LIKE ("%dog%") OR description LIKE ("%cat%")',
 '/* En principio, la tabla intermedia y la relacion entre film y actor deber√≠a evitar esto. En cualquier caso, si hubiera alguno, aparecer√≠a con */\n\nSELECT * \n\tFROM film_actor\n    WHERE film_id IS NULL',
 'SELECT lower(title) AS film_title, release_year\n\tFROM film\n    WHERE release_year BETWEEN 2005 AND 2010',
 'SELECT lower(f.title) AS film_title\n\tFROM film as f\n    INNER JOIN film_category AS fc\n    USING (film_id)\n    WHERE category_id = (\n\t\t\t\t\t\tSELECT category_id\n\t\t\t\t\t\t\tFROM category\n\t\t\t\t\t\t\tWHERE name = "Family"\n    )',
 'SELECT CONCAT(lower(a.first_name), " ", lower(a.last_name)) AS actor_name\n\tFROM actor AS a\n    INNER JOIN film_actor AS fa\n    USING (actor_id)\n    GROUP BY actor_name\n    HAVING COUNT(fa.film_id) > 10',
 'SELECT lower(title)\n\tFROM film\n    WHERE rating = "R" AND length > 120',
 'SELECT c.name, ROUND(AVG(length), 2) AS avg_length_in_min\n\tFROM category AS c\n    INNER JOIN film_category AS fc\n    USING (category_id)\n    INNER JOIN film AS f\n    USING (film_id)\n    GROUP BY (c.name)\n    HAVING AVG(length) > 120',
 'WITH actors_in_films AS (\n\t\t\t\t\t\tSELECT CONCAT(lower(a.first_name), " ", lower(a.last_name)) AS actor_name, COUNT(fa.actor_id) AS num_of_films\n\t\t\t\t\t\t\tFROM actor AS a\n                            INNER JOIN film_actor AS fa\n                            USING (actor_id)\n                            GROUP BY (fa.actor_id))\n\t\t\t\t\t\nSELECT actor_name, num_of_films\n\tFROM actors_in_films\n\tWHERE num_of_films > 5',
 'SELECT DISTINCT lower(f.title) AS film_title\n\tFROM rental AS r\n    INNER JOIN inventory AS i\n    USING (inventory_id)\n    INNER JOIN film AS f\n    USING (film_id)\n    WHERE r.rental_id IN (\n\t\t\t\t\t\t\tSELECT rental_id\n\t\t\t\t\t\t\tFROM rental\n\t\t\t\t\t\t\tWHERE TIMESTAMPDIFF(DAY, rental_date, return_date) > 5\n)',
 'WITH actors_in_horror AS (\n\t\t\t\t\t\tSELECT DISTINCT CONCAT(lower(a.first_name), " ", lower(a.last_name)) AS actor_name\n\t\t\t\t\t\t\tFROM actor as a\n\t\t\t\t\t\t\tINNER JOIN film_actor AS fm\n\t\t\t\t\t\t\tUSING (actor_id)\n\t\t\t\t\t\t\tINNER JOIN film_category AS fc\n\t\t\t\t\t\t\tUSING (film_id)\n\t\t\t\t\t\t\tINNER JOIN category AS c\n\t\t\t\t\t\t\tUSING (category_id)\n\t\t\t\t\t\t\tWHERE c.name = "Horror")\n    \nSELECT CONCAT(lower(a.first_name), " ", lower(a.last_name)) AS actor_name\n\tFROM actor AS a\n    WHERE CONCAT(lower(a.first_name), " ", lower(a.last_name)) NOT IN ( SELECT actor_name FROM actors_in_horror)',
 'SELECT lower(title) AS film\n\tFROM film AS f\n    INNER JOIN film_category AS fm\n    USING (film_id)\n    INNER JOIN category AS c\n    USING(category_id)\n    WHERE c.name = "Comedy" AND f.length > 180',
 '-- Encuentra todos los actores que han actuado juntos en al menos una pel√≠cula. \n-- La consulta debe mostrar el nombre y apellido de los actores y el n√∫mero de pel√≠culas en las que han actuado juntos.\n\n/* Primero: ver los actores que comparten film_id en film_actor. \n\tSe hace un self join cuando fa1.film_id = fa2.film_id y para evitar duplicados, se une solo si fa1.actor_id < fa2.actor_id. \n    As√≠, si el 1 y el 10 est√°n en la misma peli, cuenta solo cuando actor1 es 1 y actor2 es 10 y no viceversa.\n    \n    Segundo: Agrupar por pares de actores que comparten el film_id. \n\t\tAs√≠ podemos contar los film_id en las que aparecen juntos.\n        \n\tTercero: Mostrar el nombre de los actores. \n\t\tComo se ha hecho un self join, habr√° que hacer un join a cada film_actor para poder mostrar los nombres de actor1 y actor2*/\n    \nSELECT CONCAT(lower(a1.first_name), " ", lower(a1.last_name)) AS actor_1, CONCAT(lower(a2.first_name), " ", lower(a2.last_name)) AS actor_2, COUNT(fa1.film_id) AS films_together\n\tFROM film_actor AS fa1\n    INNER JOIN film_actor AS fa2\n    ON fa1.film_id = fa2.film_id\n    AND fa1.actor_id < fa2.actor_id\n    INNER JOIN actor AS a1\n    ON fa1.actor_id = a1.actor_id\n    INNER JOIN actor AS a2\n    ON fa2.actor_id = a2.actor_id\n    GROUP BY actor_1, actor_2',
 '/* Primero: ver los actores que comparten film_id en film_actor. \n\tSe hace un self join cuando fa1.film_id = fa2.film_id y para evitar duplicados, se une solo si fa1.actor_id < fa2.actor_id. \n    As√≠, si el 1 y el 10 est√°n en la misma peli, cuenta solo cuando actor1 es 1 y actor2 es 10 y no viceversa.\n    \n    Segundo: Agrupar por pares de actores que comparten el film_id. \n\t\tAs√≠ podemos contar los film_id en las que aparecen juntos.\n        \n\tTercero: Mostrar el nombre de los actores. \n\t\tComo se ha hecho un self join, habr√° que hacer un join a cada film_actor para poder mostrar los nombres de actor1 y actor2*/\n    \nSELECT CONCAT(lower(a1.first_name), " ", lower(a1.last_name)) AS actor_1, CONCAT(lower(a2.first_name), " ", lower(a2.last_name)) AS actor_2, COUNT(fa1.film_id) AS films_together\n\tFROM film_actor AS fa1\n    INNER JOIN film_actor AS fa2\n    ON fa1.film_id = fa2.film_id\n    AND fa1.actor_id < fa2.actor_id\n    INNER JOIN actor AS a1\n    ON fa1.actor_id = a1.actor_id\n    INNER JOIN actor AS a2\n    ON fa2.actor_id = a2.actor_id\n    GROUP BY actor_1, actor_2',
 '']

Now, some queries are though to clean, and some quieries as `''` also exists. To solve this, another cleaning is performed over the `clean_quieries` list.

In [14]:
while "" in clean_queries:
        clean_queries.remove(query)

In [16]:
for query in clean_queries:
    if "/*" in query:
        clean_queries.remove(query)
    elif "--" in query:
        clean_queries.remove(query)

In [10]:
while "/*" in query:
    clean_queries.remove(query)

In [31]:
results = []
for query in clean_queries:
    mycursor.execute(query)
    results.append(mycursor.fetchall())

In [41]:
df = pd.DataFrame(results[-1])

In [43]:
df.sample(10)

                    0                1  2
3852      tom miranda   matthew carrey  2
4733      mena temple      fay winslet  1
4208  parker goldberg      will wilson  1
3548     goldie brody    ellen presley  1
9047   daryl crawford  morgan williams  2
9681        emily dee      mena hopper  1
6599   scarlett damon        jon chase  3
847         joe swank   kirsten akroyd  1
9419     ewan gooding        jon chase  1
5639    angela hudson      harvey hope  1

In [ ]:
df_2 = pd.read_sql_query(clean_queries[-1], cnx)

In [47]:
df_2.sample(10)

              actor_1           actor_2  films_together
2258   cameron streep  groucho williams               1
1878    lucille tracy     minnie kilmer               1
7537      gene willis       renee tracy               1
1302    vivien bergen       whoopi hurt               2
4287  julia barrymore       harvey hope               1
3516     tom mckellen       mary keitel               1
186          ed chase          uma wood               3
1359    vivien bergen     gene mckellen               1
1558     fred costner        reese west               2
1223         uma wood       tim hackman               1